app/admin/pizzas.rb

      f.input :filling
      f.input :category
      f.input :description
      f.input :pizza_dimension, collection: PizzaDimension.all.decorate
---
SELECT "categories".* FROM "categories"
SELECT "pizza_dimensions".* FROM "pizza_dimensions"