app/views/pizzas/_order_dropdown.haml

SELECT "pizzas".* FROM "pizzas"
---
%ul.dropdown-menu
  - Pizzas::PizzasQuery::ORDERS.each do |order|