app/views/pizzas/index.haml

SELECT COUNT(*) FROM "pizzas"
SELECT "categories".* FROM "categories"
---
          All
          %span.badge.general-badge= Pizza.count
      - Category.all.each do |category|

SELECT COUNT(*) FROM "pizzas" WHERE "pizzas"."category_id" = $1  [["category_id", 1]]
---
            = category.name
            %span.badge.general-badge= category.pizzas.count