app/queries/pizzas/pizzas_query.rb

    def initialize(params)
      super
      @params[:sort_by] ||= 'name_asc'
      @scope = Pizza.all
---
SELECT "pizzas".* FROM "pizzas"

    def by_category
      return @scope unless Category.find_by(id: params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]