app/controllers/pizzas_controller.rb

SELECT "pizzas".* FROM "pizzas"
---
  def index
    @pagy, @pizzas = pagy(::Pizzas::PizzasQuery.new(params).call)
    @pizzas = @pizzas.includes([:pizza_pictures]).decorate

SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
SELECT "pizza_dimensions".* FROM "pizza_dimensions"
---
  def show
    @pizza = Pizza.find(params[:id]).decorate
    @dimensions = PizzaDimension.all