app/models/user.rb

  def self.from_omniauth(access_token)
    email = access_token.info['email'].downcase
    user = User.find_by(email: email)

    user ||= User.new(
      email: email,
      password: Devise.friendly_token[0, 20]
    )
    user.skip_confirmation!
    user.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "denis1sorokin@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
UPDATE "users" SET "confirmed_at" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["confirmed_at", "2023-02-01 10:38:28.963693"], ["updated_at", "2023-02-01 10:38:28.965091"], ["id", 3]]