app/interactors/addresses/address_update.rb

INSERT INTO "addresses" ("first_name", "last_name", "address", "city", "country", "phone", "user_id", "type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def validate_form
      current_form.validate(address_params) ? current_form.save : context.fail!